In [3]:
import numpy as np
import pandas as pd

In [71]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [72]:
print(f"the shape of data {df.shape}\n")
print(f"the details of data {df.info}\n")
print(f"columns of data {df.columns}\n")
print(f"Data types of data {df.dtypes}\n")

the shape of data (5, 4)

the details of data <bound method DataFrame.info of             From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air">

columns of data Index(['From_To', 'FlightNumber', 'RecentDelays', 'Airline'], dtype='object')

Data types of data From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [73]:
#printing first 5 rows of dataframe
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [74]:
##Checking missing values
df.isnull().sum()

From_To         0
FlightNumber    2
RecentDelays    0
Airline         0
dtype: int64

In [75]:
df.loc[1,'FlightNumber'] = 10055
df.loc[3,'FlightNumber'] = 10075

In [76]:
df['FlightNumber'] = df['FlightNumber'].astype('int64')

In [77]:
# new data frame with split value columns
new = df["From_To"].str.split("_", n = 1, expand = True)
  
# making separate first name column from new data frame
df["Source"]= new[0]
  
# making separate last name column from new data frame
df["Destination"]= new[1]

In [78]:
df

,From_To,FlightNumber,RecentDelays,Airline,Source,Destination
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [79]:
###Standardise string values of new columns
df['Source']=df['Source'].apply(lambda x: x.title())

In [80]:
df['Destination']=df['Destination'].apply(lambda x: x.title())

In [81]:
# Remove column name 'A'
df=df.drop(['From_To'], axis = 1)

In [82]:
delays = pd.DataFrame(df['RecentDelays'].to_list(), columns = ['delay_1', 'delay_2', 'delay_3'])
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [83]:
df.drop(['RecentDelays'], inplace=True, axis=1)
df

   FlightNumber              Airline    Source Destination
0         10045               KLM(!)    London       Paris
1         10055    <Air France> (12)    Madrid       Milan
2         10065  (British Airways. )    London   Stockholm
3         10075       12. Air France  Budapest       Paris
4         10085          "Swiss Air"  Brussels      London

In [84]:

df.insert(loc = 3, column='delay_1' , value=delays['delay_1'])
df.insert(loc = 4, column='delay_2' , value=delays['delay_2'])
df.insert(loc = 5, column='delay_3' , value=delays['delay_3'])
df

,FlightNumber,Airline,Source,delay_1,delay_2,delay_3,Destination
0,10045,KLM(!),London,23.0,47.0,NaN,Paris
1,10055,<Air France> (12),Madrid,NaN,NaN,NaN,Milan
2,10065,(British Airways. ),London,24.0,43.0,87.0,Stockholm
3,10075,12. Air France,Budapest,13.0,NaN,NaN,Paris
4,10085,"""Swiss Air""",Brussels,67.0,32.0,NaN,London